package gateway

import (
	"fmt"

	"github.com/spf13/cobra"
)

const (
	colorLeft  = "\033[1;38;2;55;90;150m"
	colorRight = "\033[1;38;2;213;70;70m"
	banner     = "\r\n" +
		colorLeft + "███████╗ ██████╗████████╗ ██████╗ " + colorRight + " ██████╗██╗      █████╗ ██╗    ██╗\n" +
		colorLeft + "██╔════╝██╔════╝╚══██╔══╝██╔═══██╗" + colorRight + "██╔════╝██║     ██╔══██╗██║    ██║\n" +
		colorLeft + "█████╗  ██║        ██║   ██║   ██║" + colorRight + "██║     ██║     ███████║██║ █╗ ██║\n" +
		colorLeft + "██╔══╝  ██║        ██║   ██║   ██║" + colorRight + "██║     ██║     ██╔══██║██║███╗██║\n" +
		colorLeft + "███████╗╚██████╗   ██║   ╚██████╔╝" + colorRight + "╚██████╗███████╗██║  ██║╚███╔███╔╝\n" +
		colorLeft + "╚══════╝ ╚═════╝   ╚═╝    ╚═════╝ " + colorRight + " ╚═════╝╚══════╝╚═╝  ╚═╝ ╚══╝╚══╝\n" +
		"\033[0m\r\n"
)

func NewGatewayCommand() *cobra.Command {
	var debug bool

	cmd := &cobra.Command{
		Use:     "gateway",
		Aliases: []string{"g"},
		Short:   "Start ectoclaw gateway",
		Args:    cobra.NoArgs,
		RunE: func(_ *cobra.Command, _ []string) error {
			fmt.Printf("%s", banner)
			return gatewayCmd(debug)
		},
	}

	cmd.Flags().BoolVarP(&debug, "debug", "d", false, "Enable debug logging")

	return cmd
}
